In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.read_excel("Titanic.xlsx",sheet_name="Titanic")

In [3]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [ ]:
df.set_index?

In [4]:
df.set_index("PassengerId")

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
888,1,1,"Graham, Miss Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
889,0,3,"Johnston, Miss Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [ ]:
df

In [5]:
df.set_index("PassengerId",inplace = True)

In [6]:
df

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
888,1,1,"Graham, Miss Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
889,0,3,"Johnston, Miss Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [7]:
df.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [8]:
df.head(10)

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
8,0,3,"Palsson, Master Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

In [9]:
df.tail()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
888,1,1,"Graham, Miss Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
889,0,3,"Johnston, Miss Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [10]:
df.tail(10)

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
882,0,3,"Markun, Mr. Johann",male,33.0,0,0,349257,7.8958,NaN,S
883,0,3,"Dahlberg, Miss Gerda Ulrika",female,22.0,0,0,7552,10.5167,NaN,S
884,0,2,"Banfield, Mr. Frederick James",male,28.0,0,0,C.A./SOTON 34068,10.5000,NaN,S
885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S
886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q
887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
888,1,1,"Graham, Miss Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
889,0,3,"Johnston, Miss Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [11]:
df.sample()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S

In [12]:
df.sample(10)

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
457,0,1,"Millet, Mr. Francis Davis",male,65.0,0,0,13509,26.5500,E38,S
796,0,2,"Otter, Mr. Richard",male,39.0,0,0,28213,13.0000,NaN,S
889,0,3,"Johnston, Miss Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
144,0,3,"Burke, Mr. Jeremiah",male,19.0,0,0,365222,6.7500,NaN,Q
385,0,3,"Plotcharsky, Mr. Vasil",male,NaN,0,0,349227,7.8958,NaN,S
48,1,3,"O'Driscoll, Miss Bridget",female,NaN,0,0,14311,7.7500,NaN,Q
411,0,3,"Sdycoff, Mr. Todor",male,NaN,0,0,349222,7.8958,NaN,S
703,0,3,"Barbara, Miss Saiide",female,18.0,0,1,2691,14.4542,NaN,C
93,0,1,"Chaffee, Mr. Herbert Fuller",male,46.0,1,0,W.E.P. 5734,61.1750,E31,S
637,0,3,"Leinonen, Mr. Antti Gustaf",male,32.0,0,0,STON/O 2. 3101292,7.9250,NaN,S

In [13]:
clos =df.columns

In [14]:
clos

Index(['Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp', 'Parch', 'Ticket',
       'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [15]:
rows = df.index

In [16]:
rows

Index([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,
       ...
       882, 883, 884, 885, 886, 887, 888, 889, 890, 891],
      dtype='int64', name='PassengerId', length=891)

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 891 entries, 1 to 891
Data columns (total 11 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  891 non-null    int64
 1   Pclass    891 non-null    int64
 2   Name      891 non-null    object
 3   Sex       891 non-null    object
 4   Age       714 non-null    float64
 5   SibSp     891 non-null    int64
 6   Parch     891 non-null    int64
 7   Ticket    891 non-null    object
 8   Fare      891 non-null    float64
 9   Cabin     204 non-null    object
 10  Embarked  889 non-null    object
dtypes: float64(2), int64(4), object(5)
memory usage: 83.5+ KB

In [18]:
df.shape

(891, 11)

In [ ]:
rows_count = df.shape[0]

In [ ]:
rows_count

In [ ]:
columns_count = df.shape[1]

In [ ]:
columns_count

In [ ]:
df

In [19]:
df.describe()

         Survived      Pclass         Age       SibSp       Parch        Fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [20]:
df['Age']

PassengerId
1      22.0
2      38.0
3      26.0
4      35.0
5      35.0
       ...
887    27.0
888    19.0
889     NaN
890    26.0
891    32.0
Name: Age, Length: 891, dtype: float64

In [21]:
df[["Age"]]

              Age
PassengerId
1            22.0
2            38.0
3            26.0
4            35.0
5            35.0
...           ...
887          27.0
888          19.0
889           NaN
890          26.0
891          32.0

[891 rows x 1 columns]

In [22]:
df[["Age","Pclass"]]

              Age  Pclass
PassengerId
1            22.0       3
2            38.0       1
3            26.0       3
4            35.0       1
5            35.0       3
...           ...     ...
887          27.0       2
888          19.0       1
889           NaN       3
890          26.0       1
891          32.0       3

[891 rows x 2 columns]

In [23]:
df

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
888,1,1,"Graham, Miss Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
889,0,3,"Johnston, Miss Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [24]:
df.loc[6,:]

Survived                   0
Pclass                     3
Name        Moran, Mr. James
Sex                     male
Age                      NaN
SibSp                      0
Parch                      0
Ticket                330877
Fare                  8.4583
Cabin                    NaN
Embarked                   Q
Name: 6, dtype: object

In [25]:
df.loc[6,"Age"]

nan

In [26]:
df.loc[5:10,"Age":]

              Age  SibSp  Parch  Ticket     Fare Cabin Embarked
PassengerId
5            35.0      0      0  373450   8.0500   NaN        S
6             NaN      0      0  330877   8.4583   NaN        Q
7            54.0      0      0   17463  51.8625   E46        S
8             2.0      3      1  349909  21.0750   NaN        S
9            27.0      0      2  347742  11.1333   NaN        S
10           14.0      1      0  237736  30.0708   NaN        C

In [27]:
df.iloc[5:10,4:]

              Age  SibSp  Parch  Ticket     Fare Cabin Embarked
PassengerId
6             NaN      0      0  330877   8.4583   NaN        Q
7            54.0      0      0   17463  51.8625   E46        S
8             2.0      3      1  349909  21.0750   NaN        S
9            27.0      0      2  347742  11.1333   NaN        S
10           14.0      1      0  237736  30.0708   NaN        C

In [28]:
df.iloc[6,4]

54.0

In [30]:
df.iloc[[5,9,8,4,10],:]

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C
9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
11,1,3,"Sandstrom, Miss Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S

In [31]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 891 entries, 1 to 891
Data columns (total 11 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  891 non-null    int64
 1   Pclass    891 non-null    int64
 2   Name      891 non-null    object
 3   Sex       891 non-null    object
 4   Age       714 non-null    float64
 5   SibSp     891 non-null    int64
 6   Parch     891 non-null    int64
 7   Ticket    891 non-null    object
 8   Fare      891 non-null    float64
 9   Cabin     204 non-null    object
 10  Embarked  889 non-null    object
dtypes: float64(2), int64(4), object(5)
memory usage: 115.8+ KB

In [32]:
df.nunique()

Survived      2
Pclass        3
Name        891
Sex           2
Age          88
SibSp         7
Parch         7
Ticket      681
Fare        248
Cabin       147
Embarked      3
dtype: int64

In [33]:
df["Survived"].unique()

array([0, 1], dtype=int64)

In [34]:
df["Embarked"].unique()

array(['S', 'C', 'Q', nan], dtype=object)

In [35]:
df.isnull()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,False,False,False,False,False,False,False,False,False,True,False
2,False,False,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False,True,False
4,False,False,False,False,False,False,False,False,False,False,False
5,False,False,False,False,False,False,False,False,False,True,False
...,...,...,...,...,...,...,...,...,...,...,...
887,False,False,False,False,False,False,False,False,False,True,False
888,False,False,False,False,False,False,False,False,False,False,False
889,False,False,False,False,True,False,False,False,False,True,False
890,False,False,False,False,False,False,False,False,False,False,False
891,False,False,False,False,False,False,False,False,False,True,False

In [36]:
df.isnull().sum()

Survived      0
Pclass        0
Name          0
Sex           0
Age         177
SibSp         0
Parch         0
Ticket        0
Fare          0
Cabin       687
Embarked      2
dtype: int64

In [37]:
df.isnull().mean()*100

Survived     0.000000
Pclass       0.000000
Name         0.000000
Sex          0.000000
Age         19.865320
SibSp        0.000000
Parch        0.000000
Ticket       0.000000
Fare         0.000000
Cabin       77.104377
Embarked     0.224467
dtype: float64

In [38]:
df["Age"]>70

PassengerId
1      False
2      False
3      False
4      False
5      False
       ...
887    False
888    False
889    False
890    False
891    False
Name: Age, Length: 891, dtype: bool

In [39]:
df[df["Age"]>70] # boolean filtering

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
97,0,1,"Goldschmidt, Mr. George B",male,71.0,0,0,PC 17754,34.6542,A5,C
117,0,3,"Connors, Mr. Patrick",male,70.5,0,0,370369,7.7500,NaN,Q
494,0,1,"Artagaveytia, Mr. Ramon",male,71.0,0,0,PC 17609,49.5042,NaN,C
631,1,1,"Barkworth, Mr. Algernon Henry Wilson",male,80.0,0,0,27042,30.0000,A23,S
852,0,3,"Svensson, Mr. Johan",male,74.0,0,0,347060,7.7750,NaN,S

In [40]:
df[(df["Age"]>70) | (df["Age"]<10)]

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
8,0,3,"Palsson, Master Gosta Leonard",male,2.00,3,1,349909,21.0750,NaN,S
11,1,3,"Sandstrom, Miss Marguerite Rut",female,4.00,1,1,PP 9549,16.7000,G6,S
17,0,3,"Rice, Master Eugene",male,2.00,4,1,382652,29.1250,NaN,Q
25,0,3,"Palsson, Miss Torborg Danira",female,8.00,3,1,349909,21.0750,NaN,S
44,1,2,"Laroche, Miss Simonne Marie Anne Andree",female,3.00,1,2,SC/Paris 2123,41.5792,NaN,C
...,...,...,...,...,...,...,...,...,...,...,...
832,1,2,"Richards, Master George Sibley",male,0.83,1,1,29106,18.7500,NaN,S
851,0,3,"Andersson, Master Sigvard Harald Elias",male,4.00,4,2,347082,31.2750,NaN,S
852,0,3,"Svensson, Mr. Johan",male,74.00,0,0,347060,7.7750,NaN,S
853,0,3,"Boulos, Miss Nourelain",female,9.00,1,1,2678,15.2458,NaN,C
870,1,3,"Johnson, Master Harold Theodor",male,4.00,1,1,347742,11.1333,NaN,S

In [41]:
df

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
888,1,1,"Graham, Miss Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
889,0,3,"Johnston, Miss Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [42]:
df["ASD"] = 1+2

In [43]:
df

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,ASD
PassengerId,,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,3
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,3
3,1,3,"Heikkinen, Miss Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,3
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,3
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,3
...,...,...,...,...,...,...,...,...,...,...,...,...
887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,3
888,1,1,"Graham, Miss Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,3
889,0,3,"Johnston, Miss Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,3
890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,3
891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,3

In [ ]:
df.insert?

In [44]:
df.insert(2,"dfgg",0)

In [45]:
df

,Survived,Pclass,dfgg,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,ASD
PassengerId,,,,,,,,,,,,,
1,0,3,0,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,3
2,1,1,0,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,3
3,1,3,0,"Heikkinen, Miss Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,3
4,1,1,0,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,3
5,0,3,0,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,3
...,...,...,...,...,...,...,...,...,...,...,...,...,...
887,0,2,0,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,3
888,1,1,0,"Graham, Miss Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,3
889,0,3,0,"Johnston, Miss Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,3
890,1,1,0,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,3
891,0,3,0,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,3

In [ ]:
df.sort_values?

In [46]:
df.sort_values(by="Age")

,Survived,Pclass,dfgg,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,ASD
PassengerId,,,,,,,,,,,,,
804,1,3,0,"Thomas, Master Assad Alexander",male,0.42,0,1,2625,8.5167,NaN,C,3
756,1,2,0,"Hamalainen, Master Viljo",male,0.67,1,1,250649,14.5000,NaN,S,3
645,1,3,0,"Baclini, Miss Eugenie",female,0.75,2,1,2666,19.2583,NaN,C,3
470,1,3,0,"Baclini, Miss Helene Barbara",female,0.75,2,1,2666,19.2583,NaN,C,3
79,1,2,0,"Caldwell, Master Alden Gates",male,0.83,0,2,248738,29.0000,NaN,S,3
...,...,...,...,...,...,...,...,...,...,...,...,...,...
860,0,3,0,"Razi, Mr. Raihed",male,NaN,0,0,2629,7.2292,NaN,C,3
864,0,3,0,"Sage, Miss Dorothy Edith ""Dolly""",female,NaN,8,2,CA. 2343,69.5500,NaN,S,3
869,0,3,0,"van Melkebeke, Mr. Philemon",male,NaN,0,0,345777,9.5000,NaN,S,3
879,0,3,0,"Laleff, Mr. Kristo",male,NaN,0,0,349217,7.8958,NaN,S,3
889,0,3,0,"Johnston, Miss Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,3

In [ ]:
df.sort_index?

In [47]:
df.sort_values(by="Age",ascending=False)

,Survived,Pclass,dfgg,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,ASD
PassengerId,,,,,,,,,,,,,
631,1,1,0,"Barkworth, Mr. Algernon Henry Wilson",male,80.0,0,0,27042,30.0000,A23,S,3
852,0,3,0,"Svensson, Mr. Johan",male,74.0,0,0,347060,7.7750,NaN,S,3
494,0,1,0,"Artagaveytia, Mr. Ramon",male,71.0,0,0,PC 17609,49.5042,NaN,C,3
97,0,1,0,"Goldschmidt, Mr. George B",male,71.0,0,0,PC 17754,34.6542,A5,C,3
117,0,3,0,"Connors, Mr. Patrick",male,70.5,0,0,370369,7.7500,NaN,Q,3
...,...,...,...,...,...,...,...,...,...,...,...,...,...
860,0,3,0,"Razi, Mr. Raihed",male,NaN,0,0,2629,7.2292,NaN,C,3
864,0,3,0,"Sage, Miss Dorothy Edith ""Dolly""",female,NaN,8,2,CA. 2343,69.5500,NaN,S,3
869,0,3,0,"van Melkebeke, Mr. Philemon",male,NaN,0,0,345777,9.5000,NaN,S,3
879,0,3,0,"Laleff, Mr. Kristo",male,NaN,0,0,349217,7.8958,NaN,S,3
889,0,3,0,"Johnston, Miss Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,3

In [ ]:
df.sort_values(by=["Sex","Age"],ascending=[True,False])

In [48]:
df.sort_index(ascending= False)

,Survived,Pclass,dfgg,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,ASD
PassengerId,,,,,,,,,,,,,
891,0,3,0,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,3
890,1,1,0,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,3
889,0,3,0,"Johnston, Miss Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,3
888,1,1,0,"Graham, Miss Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,3
887,0,2,0,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,3
...,...,...,...,...,...,...,...,...,...,...,...,...,...
5,0,3,0,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,3
4,1,1,0,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,3
3,1,3,0,"Heikkinen, Miss Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,3
2,1,1,0,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,3
1,0,3,0,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,3

In [51]:
ord("d")

100

In [52]:
ord("T")

84

In [50]:
# axis=1 refers to columns
df.sort_index(axis=1,ascending=False)

,dfgg,Ticket,Survived,SibSp,Sex,Pclass,Parch,Name,Fare,Embarked,Cabin,Age,ASD
PassengerId,,,,,,,,,,,,,
1,0,A/5 21171,0,1,male,3,0,"Braund, Mr. Owen Harris",7.2500,S,NaN,22.0,3
2,0,PC 17599,1,1,female,1,0,"Cumings, Mrs. John Bradley (Florence Briggs Th...",71.2833,C,C85,38.0,3
3,0,STON/O2. 3101282,1,0,female,3,0,"Heikkinen, Miss Laina",7.9250,S,NaN,26.0,3
4,0,113803,1,1,female,1,0,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",53.1000,S,C123,35.0,3
5,0,373450,0,0,male,3,0,"Allen, Mr. William Henry",8.0500,S,NaN,35.0,3
...,...,...,...,...,...,...,...,...,...,...,...,...,...
887,0,211536,0,0,male,2,0,"Montvila, Rev. Juozas",13.0000,S,NaN,27.0,3
888,0,112053,1,0,female,1,0,"Graham, Miss Margaret Edith",30.0000,S,B42,19.0,3
889,0,W./C. 6607,0,1,female,3,2,"Johnston, Miss Catherine Helen ""Carrie""",23.4500,S,NaN,NaN,3
890,0,111369,1,0,male,1,0,"Behr, Mr. Karl Howell",30.0000,C,C148,26.0,3
891,0,370376,0,0,male,3,0,"Dooley, Mr. Patrick",7.7500,Q,NaN,32.0,3

In [ ]:
# Select only passengers older than 30
adults = df[df['Age'] > 30]

In [ ]:
adults

In [ ]:
# Select females AND passengers in 1st class
rich_females = df[(df['Sex'] == 'female') & (df['Pclass'] == 1)]

# Select passengers who paid more than $100 OR are in 1st class
high_value = df[(df['Fare'] > 100) | (df['Pclass'] == 1)]

In [ ]:
rich_females

In [ ]:
# Select passengers embarking from Southampton (S) or Cherbourg (C)
ports = df[df['Embarked'].isin(['S', 'C'])]

In [ ]:
ports

In [ ]:
# Select anyone with "Mr." in their name
misters = df[df['Name'].str.contains("Mr.")]

# Select names that start with "A"
starts_with_a = df[df['Name'].str.startswith("A")]

In [ ]:
starts_with_a

In [53]:
# Same as Method 2, but cleaner to read
rich_females = df.query('Sex == "female" and Pclass == 1')

In [54]:
rich_females

,Survived,Pclass,dfgg,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,ASD
PassengerId,,,,,,,,,,,,,
2,1,1,0,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,3
4,1,1,0,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,3
12,1,1,0,"Bonnell, Miss Elizabeth",female,58.0,0,0,113783,26.5500,C103,S,3
32,1,1,0,"Spencer, Mrs. William Augustus (Marie Eugenie)",female,NaN,1,0,PC 17569,146.5208,B78,C,3
53,1,1,0,"Harper, Mrs. Henry Sleeper (Myna Haxtun)",female,49.0,1,0,PC 17572,76.7292,D33,C,3
...,...,...,...,...,...,...,...,...,...,...,...,...,...
857,1,1,0,"Wick, Mrs. George Dennick (Mary Hitchcock)",female,45.0,1,1,36928,164.8667,NaN,S,3
863,1,1,0,"Swift, Mrs. Frederick Joel (Margaret Welles Ba...",female,48.0,0,0,17466,25.9292,D17,S,3
872,1,1,0,"Beckwith, Mrs. Richard Leonard (Sallie Monypeny)",female,47.0,1,1,11751,52.5542,D35,S,3
880,1,1,0,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,0,1,11767,83.1583,C50,C,3
888,1,1,0,"Graham, Miss Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,3

In [ ]:
df.info()

In [ ]:
# Shows the count of missing values per column
df.isnull().sum()

In [ ]:
# Returns True if the column contains any nulls
df.isnull().any()

In [55]:
# Counts how many rows are duplicates
df.duplicated()

PassengerId
1      False
2      False
3      False
4      False
5      False
       ...
887    False
888    False
889    False
890    False
891    False
Length: 891, dtype: bool

In [56]:
# Counts how many rows are duplicates
df.duplicated().sum()

0

In [ ]:
df[~df.duplicated(subset=["Pclass","Sex","Embarked"],keep = False)]

In [ ]:
df.query('Pclass == 2 and Embarked == "Q"')

In [ ]:
df[df["Embarked"]=="Q"].groupby("Pclass")["Pclass"].count()

In [ ]:
# Filters the DataFrame to show only the duplicated rows
df[df.duplicated(keep=False)]

In [ ]:
# Removes duplicate rows, keeping the first occurrence
df.drop_duplicates(subset=["Pclass","Sex","Embarked"],keep = False)

In [ ]:
# Shows the dtype of each column
df.dtypes

In [ ]:
# Converts the 'PassengerId' column to string (object)
s=df['Survived'].astype('str')

In [ ]:
s

In [ ]:
s[1]+s[2]

In [ ]:
# Shows the count of unique values per column
df.nunique()

In [57]:
# Shows the counts for each unique value in the 'Embarked' column
df['Embarked'].value_counts()

Embarked
S    644
C    168
Q     77
Name: count, dtype: int64

In [58]:
# Shows the counts for each unique value in the 'Sex' column
df['Sex'].value_counts()

Sex
male      577
female    314
Name: count, dtype: int64

In [ ]:
df.dtypes

In [ ]:
123//1.0

In [ ]:
df["Age_New"]=df['Age'].astype(dtype='int64',errors="ignore")

In [ ]:
df[df['Age']<10]

In [ ]:
df.astype?

In [59]:
df['Ticket'].astype(str)

PassengerId
1             A/5 21171
2              PC 17599
3      STON/O2. 3101282
4                113803
5                373450
             ...
887              211536
888              112053
889          W./C. 6607
890              111369
891              370376
Name: Ticket, Length: 891, dtype: object

In [60]:
pd.to_numeric(df['Ticket'],errors='coerce')

PassengerId
1           NaN
2           NaN
3           NaN
4      113803.0
5      373450.0
         ...
887    211536.0
888    112053.0
889         NaN
890    111369.0
891    370376.0
Name: Ticket, Length: 891, dtype: float64

In [ ]:
pd.to_numeric?

In [ ]:
# Convert 'Age' column to integer (int64)
df['Age'].astype('int64')

# Convert 'Sex' column to the more memory-efficient 'category' type
df['Sex'].astype('category')

# Convert a numerical column to string
df['Ticket'].astype(str)

In [ ]:
# Example: Convert 'Fare' which might contain placeholder strings
df['Fare'] = pd.to_numeric(df['Fare'], errors='coerce')

# Now, any non-convertible strings in 'Fare' are set to NaN.
# You can then use df.fillna() or df.drop_na() to handle them.

In [ ]:
# Convert a standard date string column
df['Date'] = pd.to_datetime(df['DateString'])

In [ ]:
Code,  Meaning,          Example
%Y,    Year with century,2025
%m,    Month as a number,12
%d,    Day of the month,  15
%b,    Abbreviated month name,Dec

In [ ]:
# Example for a date string like '15-12-2025'
df['PurchaseDate'] = pd.to_datetime(
    df['PurchaseDate'], 
    format='%d-%m-%Y'
)

In [ ]:
# Extracts the word after the comma and before the period
df['Title'] = df['Name'].str.extract('([A-Za-z]+)\.')

In [ ]:
Attribute,Purpose,Example
.dt.year,Extracts the year as an integer.,df['Date'].dt.year
.dt.month,Extracts the month (1-12).,df['Date'].dt.month
.dt.day,Extracts the day of the month.,df['Date'].dt.day
.dt.day_name(),"Extracts the weekday name (e.g., 'Monday').",df['Date'].dt.day_name()
.dt.is_leap_year,Returns a boolean (True/False).,df['Date'].dt.is_leap_year

In [ ]:
# Extracts the week of the year (01-52)
df['Week_of_Year'] = df['OrderDate'].dt.isocalendar().week

# Filters for data in the first quarter (Jan, Feb, Mar)
q1_data = df[df['OrderDate'].dt.quarter == 1]

In [ ]:
# Convert to 'category' type first
df['Severity'] = df['Severity'].astype('category')

# Define the logical order
new_order = ['Low', 'Medium', 'High', 'Critical']

# Apply the new order
df['Severity'] = df['Severity'].cat.reorder_categories(new_order, ordered=True)

In [61]:
# Calculate the average Fare paid by passengers in each Pclass (1st, 2nd, 3rd)
df.groupby('Pclass')['Fare'].mean()

Pclass
1    84.154687
2    20.662183
3    13.675550
Name: Fare, dtype: float64

In [62]:
# Group by 'Pclass' and calculate:
# 1. The min and max of 'Age'
# 2. The sum of 'Fare'
grouped_stats = df.groupby('Pclass').agg(
    {
        'Age': ['min', 'max'],
        'Fare': 'sum'
    }
)

In [63]:
grouped_stats

         Age              Fare
         min   max         sum
Pclass
1       0.92  80.0  18177.4125
2       0.67  70.0   3801.8417
3       0.42  74.0   6714.6951

In [66]:
df['Pclass'].value_counts().sort_index()

Pclass
1    216
2    184
3    491
Name: count, dtype: int64

In [68]:
df.isna().sum()

Survived      0
Pclass        0
dfgg          0
Name          0
Sex           0
Age         177
SibSp         0
Parch         0
Ticket        0
Fare          0
Cabin       687
Embarked      2
ASD           0
dtype: int64

In [67]:
df.isnull().sum()

Survived      0
Pclass        0
dfgg          0
Name          0
Sex           0
Age         177
SibSp         0
Parch         0
Ticket        0
Fare          0
Cabin       687
Embarked      2
ASD           0
dtype: int64

In [69]:
df[df['Embarked'].isna()]

,Survived,Pclass,dfgg,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,ASD
PassengerId,,,,,,,,,,,,,
62,1,1,0,"Icard, Miss Amelie",female,38.0,0,0,113572,80.0,B28,NaN,3
830,1,1,0,"Stone, Mrs. George Nelson (Martha Evelyn)",female,62.0,0,0,113572,80.0,B28,NaN,3

In [70]:
df['Embarked'].unique()

array(['S', 'C', 'Q', nan], dtype=object)

In [76]:
df.dropna(how="any",axis=1)

,Survived,Pclass,dfgg,Name,Sex,SibSp,Parch,Ticket,Fare,ASD
PassengerId,,,,,,,,,,
1,0,3,0,"Braund, Mr. Owen Harris",male,1,0,A/5 21171,7.2500,3
2,1,1,0,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,1,0,PC 17599,71.2833,3
3,1,3,0,"Heikkinen, Miss Laina",female,0,0,STON/O2. 3101282,7.9250,3
4,1,1,0,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,1,0,113803,53.1000,3
5,0,3,0,"Allen, Mr. William Henry",male,0,0,373450,8.0500,3
...,...,...,...,...,...,...,...,...,...,...
887,0,2,0,"Montvila, Rev. Juozas",male,0,0,211536,13.0000,3
888,1,1,0,"Graham, Miss Margaret Edith",female,0,0,112053,30.0000,3
889,0,3,0,"Johnston, Miss Catherine Helen ""Carrie""",female,1,2,W./C. 6607,23.4500,3
890,1,1,0,"Behr, Mr. Karl Howell",male,0,0,111369,30.0000,3
891,0,3,0,"Dooley, Mr. Patrick",male,0,0,370376,7.7500,3

In [78]:
df['Embarked_fill']=df['Embarked'].fillna("Data Missing")

In [79]:
df

,Survived,Pclass,dfgg,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,ASD,Embarked_fill
PassengerId,,,,,,,,,,,,,,
1,0,3,0,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,3,S
2,1,1,0,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,3,C
3,1,3,0,"Heikkinen, Miss Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,3,S
4,1,1,0,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,3,S
5,0,3,0,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,3,S
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
887,0,2,0,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,3,S
888,1,1,0,"Graham, Miss Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,3,S
889,0,3,0,"Johnston, Miss Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,3,S
890,1,1,0,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,3,C
891,0,3,0,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,3,Q

In [80]:
df['Embarked'].unique()

array(['S', 'C', 'Q', nan], dtype=object)

In [81]:
df['Embarked_fill'].unique()

array(['S', 'C', 'Q', 'Data Missing'], dtype=object)

In [83]:
df[df['Embarked'].isnull()]

,Survived,Pclass,dfgg,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,ASD,Embarked_fill
PassengerId,,,,,,,,,,,,,,
62,1,1,0,"Icard, Miss Amelie",female,38.0,0,0,113572,80.0,B28,NaN,3,Data Missing
830,1,1,0,"Stone, Mrs. George Nelson (Martha Evelyn)",female,62.0,0,0,113572,80.0,B28,NaN,3,Data Missing

In [85]:
embares=df.loc[[60,61,62,63,64,65,828,829,830,831,832],:]

In [86]:
embares['Embarked'].fillna(method='ffill')

C:\Users\hp\AppData\Local\Temp\ipykernel_15396\1213973197.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  embares['Embarked'].fillna(method='ffill')

PassengerId
60     S
61     C
62     C
63     S
64     S
65     C
828    C
829    Q
830    Q
831    C
832    S
Name: Embarked, dtype: object

In [87]:
embares['Embarked'].fillna(method='bfill')

C:\Users\hp\AppData\Local\Temp\ipykernel_15396\3520525871.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  embares['Embarked'].fillna(method='bfill')

PassengerId
60     S
61     C
62     S
63     S
64     S
65     C
828    C
829    Q
830    C
831    C
832    S
Name: Embarked, dtype: object

In [88]:
df['Embarked'].mode()

0    S
Name: Embarked, dtype: object

In [90]:
df['Embarked'].fillna("S").unique()

array(['S', 'C', 'Q'], dtype=object)

In [ ]:
# Filters the DataFrame to show only rows where 'Age' is null
missing_age_rows = df[df['Age'].isnull()]

In [ ]:
# Fills all missing 'Cabin' values with the string 'Unknown'
df['Cabin'].fillna('Unknown', inplace=True)

In [ ]:
# Calculate the median of the 'Age' column
age_median = df['Age'].median()

# Fill the missing 'Age' values with the calculated median
df['Age'].fillna(age_median, inplace=True)

Method,Description,Example
method='ffill',Forward Fill: Replaces null with the previous non-null value.,"df['StockPrice'].fillna(method='ffill', inplace=True)"
method='bfill',Backward Fill: Replaces null with the next non-null value.,"df['StockPrice'].fillna(method='bfill', inplace=True)"